summer2022/bayes/bayes-summer2022.tex
% Created 2022-05-24 Tue 10:32
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=1in,right=1in,bottom=1in,top=1in]{geometry}
\setlength{\parindent}{0pt}
\setlength{\parskip}{2mm}
\date{Summer 2022}
\title{PSYC 4390/5090: Bayesian Statistics}
\hypersetup{
 pdfauthor={},
 pdftitle={PSYC 4390/5090: Bayesian Statistics},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Contact info}
\label{sec:org292ff12}
\begin{itemize}
\item Professor: Thomas J. Faulkenberry, Ph.D
\item Office: Math 301
\item Office hours: MTRF 9-11 am
\item Email: faulkenberry@tarleton.edu
\item Website: \url{http://tomfaulkenberry.github.io}
\item Phone: 254-968-9816
\end{itemize}

\section*{Course description}
\label{sec:org6055c4c}

Bayesian statistics is becoming an increasingly popular tool for scientific inference in the behavioral sciences. This course is designed to walk you through the "what", "why", and "how" of Bayesian statistics. We will begin with a review of the familiar statistical concepts of hypothesis testing and estimation, both of which form the cornerstone of statistical inference that you already know from previous courses. Then you will learn what it means to do these things from a \emph{Bayesian} perspective. Once the necessary background and motivation is provided, we will walk through several "case studies" that describe how to do Bayesian statistics for several common research designs that are ubiquitous across many fields of study, including correlation, two-group comparisons, designs with multiple variables, covariate designs, and linear regression.  

Students taking this course are expected to have \textbf{previously} taken a course in statistics (or equivalent statistical training). 

\section*{Course materials}
\label{sec:org884a0c7}

There is no required textbook for the course. However, I recommend you have access to a good statistics textbook (\href{https://www.amazon.com/Psychological-Statistics-Basics-Thomas-Faulkenberry-dp-1032020954/dp/1032020954}{mine} is cheap).  In addition, you'll need to have access to a computer on which you can install the following software packages:

\begin{itemize}
\item R statistical software (free download from \href{http://www.r-project.org}{https://www.r-project.org})
\item RStudio (free download from \href{http://www.rstudio.com}{https://www.rstudio.com})
\item JASP (free download from \url{https://jasp-stats.org})
\end{itemize}

\section*{Student learning outcomes}
\label{sec:orgb61f86d}

\begin{enumerate}
\item perform and interpret basic techniques of statistical inference in both a traditional (frequentist) and Bayesian framework.
\item understand the basic concepts of prior, likelihood, and posterior, and describe how Bayes' rule links all three.
\item use both JASP and R to perform Bayesian inference on simple one-parameter models (e.g., binomial models)
\item perform and interpret techniques of Bayesian inference for common designs in the behavioral sciences, including correlations, two-group comparisons, multivariate designs, and linear regression.
\end{enumerate}

\section*{Requirements and grading}
\label{sec:org2a87883}

\begin{itemize}
\item Homework exercises (70 pts)
\item Research proposal (30 pts)
\item \emph{Total = 100 points}
\end{itemize}

Grades will be assigned based on the percentage of points you accumulate out of a total possible 100 points.  I will use the standard grading scale of A=90\%, B=80\%, etc.

\subsection*{Homework exercises (70\% of grade)}
\label{sec:org1861aba}
There will be 7 content units delivered during the 4-week session (approximately 2 per week). For each unit, I will provide you with a detailed video lecture and an accompanying set of lecture notes. To practice the concepts you learn in each unit, you will complete a short set of exercises.  Each exercise set will be worth 10 points, giving a total of 70 points for the session.

\subsection*{Research proposal (30\% of grade)}
\label{sec:org33ed9d3}
Before the last day of the course, you will submit a short research proposal that demonstrates your knowledge of how to apply Bayesian statistics to answer some empirical question in the behavioral sciences. Studies that propose replication and confirmation are especially encouraged (see \href{https://psyarxiv.com/5je9u/}{here} for an example of such a study)!  Your research proposal must contain the following three sections: (1) brief description of the research question; (2) brief description of the data collection method; and (3) details on the proposed Bayesian analyses of the data you would collect.  An example proposal will be provided early in the course.  

\section*{Course Communication}
\label{sec:org8b74043}

This course is designed to be an intensive, interactive course on Bayesian statistics, which is my field of expertise.  That means that I will be available for one-on-one consultation most any time.  Just stop by my office or give me a call.

All official course communication (questions, setting up a meeting, etc.) will be conducted by email.  Any time you need to contact me, feel free to send me an email at faulkenberry@tarleton.edu.  I only ask that you adhere to two guidelines:
\begin{itemize}
\item please include the course name (Bayesian statistics) in the subject line.  For example, one good way to do this is:  Subject: [Bayesian statistics] Question about problem set 3
\item please use proper email etiquette.  Include a salutation (e.g., Dear Dr. Faulkenberry), complete sentences, and a closing (e.g., "Regards, Your Name").  You might be surprised how many times I get an email from a nondescript email address with no indication from WHOM the email was sent!
\end{itemize}

Also, I will be sending periodic emails to each of you that update you on course progress, due dates, etc.  It is imperative that you check your \emph{Tarleton email address} regularly so that you don't miss any of these messages.

\section*{University Policy on "F" Grades}
\label{sec:orgbdb9cfb}
Beginning in Fall 2015, Tarleton will begin differentiating between a failed grade in a class because a student never attended (F0 grade), stopped attending at some point in the semester (FX grade), or because the student did not pass the course (F) but attended the entire semester. These grades will be noted on the official transcript. Stopping or never attending class can result in the student having to return aid monies received.  For more information see the Tarleton Financial Aid website.

\section*{Academic Honesty}
\label{sec:org4efa1b6}

Tarleton State University expects its students to maintain high standards of personal and scholarly conduct. Students guilty of academic dishonesty are subject to disciplinary action. Cheating, plagiarism (submitting another person’s materials or ideas as one’s own), or doing work for another person who will receive academic credit are all disallowed. This includes the use of unauthorized books, notebooks, or other sources in order to secure of give help during an examination, the unauthorized copying of examinations, assignments, reports, or term papers, or the presentation of unacknowledged material as if it were the student’s own work. Disciplinary action may be taken beyond the academic discipline administered by the faculty member who teaches the course in which the cheating took place.

In particular, any exam taken online must be completed without the aid of any unauthorized resource (including using any search engine, Google, etc.).  Authorized resources are limited only to the official textbook and any lecture notes from the course.  Any other authorized resources will be provided to you before the exam.  The minimum sanction for violation of this policy is a grade of 0 on the affected exam.

Each student’s honesty and integrity are taken for granted. However, if I find evidence of academic misconduct I will pursue the matter to the fullest extent permitted by the university. ACADEMIC MISCONDUCT OR DISHONESTY WILL RESULT IN A GRADE OF F FOR THE COURSE.  Students are strongly advised to avoid even the \emph{appearance} of academic misconduct. 

\section*{Academic Affairs Core Value Statements}
\label{sec:orgceaf22a}

\subsection*{Academic Integrity Statement}
\label{sec:orgb1c6fcc}
Tarleton State University's core values are integrity, leadership, tradition, civility, excellence, and service.  Central to these values is integrity, which is maintaining a high standard of personal and scholarly conduct.  Academic integrity represents the choice to uphold ethical responsibility for one’s learning within the academic community, regardless of audience or situation.

\subsection*{Academic Civility Statement}
\label{sec:orgd9661aa}
Students are expected to interact with professors and peers in a respectful manner that enhances the learning environment. Professors may require a student who deviates from this expectation to leave the face-to-face (or virtual) classroom learning environment for that particular class session (and potentially subsequent class sessions) for a specific amount of time. In addition, the professor might consider the university disciplinary process (for Academic Affairs/Student Life) for egregious or continued disruptive behavior.

\subsection*{Academic Excellence Statement}
\label{sec:org7dc110a}
Tarleton holds high expectations for students to assume responsibility for their own individual learning. Students are also expected to achieve academic excellence by:
\begin{itemize}
\item honoring Tarleton’s core values, upholding high standards of habit and behavior.
\item maintaining excellence through class attendance and punctuality, preparing for active participation in all learning experiences.
\item putting forth their best individual effort.
\item continually improving as independent learners.
\item engaging in extracurricular opportunities that encourage personal and academic growth.
\item reflecting critically upon feedback and applying these lessons to meet future challenges.
\end{itemize}

\section*{Students with Disabilities Policy}
\label{sec:orga1238df}

It is the policy of Tarleton State University to comply with the Americans with Disabilities  Act (www.ada.gov) and other applicable laws.  If you are a student with a disability seeking accommodations for this course, please contact the Center for Access and Academic Testing, at 254.968.9400 or caat@tarleton.edu. The office is located in Math 201. More information can be found at www.tarleton.edu/caat or in the University Catalog.​

\textbf{Note:  any changes to this syllabus will be communicated to you by the instructor!}

\section*{Tentative schedule}
\label{sec:org410038b}

\begin{center}
\begin{tabular}{rll}
Unit & Due Date & Topics covered\\
\hline
1 & 6/15 & Review of traditional (frequentist) inference\\
2 & 6/17 & The language and concepts of Bayesian statistics\\
3 & 6/22 & Tools for Bayesian statistics\\
4 & 6/24 & Bayesian inference with correlation designs\\
5 & 6/29 & Bayesian inference with two-group comparisons\\
6 & 7/1 & Bayesian inference with multivariate designs\\
7 & 7/6 & Bayesian linear regression\\
\end{tabular}
\end{center}
\end{document}